In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [3]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql
SELECT *
FROM sqlite_master
WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql 
SELECT *
FROM facts
LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

#### Write a single query that returns the:

- Minimum population
- Maximum population
- Minimum population growth
- Maximum population growth

In [6]:
%%sql
SELECT MIN(population), MAX(population), 
       MIN(population_growth), MAX(population_growth)
FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

Write a query that returns the countrie(s) with the minimum population.

In [7]:
%%sql
SELECT name
FROM facts
WHERE population = (SELECT MIN(population)
                    FROM facts);

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

Write a query that returns the countrie(s) with the maximum population.

In [8]:
%%sql
SELECT name
FROM facts
WHERE population == (SELECT MAX(population)
                    FROM facts);

 * sqlite:///factbook.db
Done.

[('World',)]

Recompute the summary statistics you found earlier while excluding the row for the whole world. They were:

- Minimum population
- Maximum population
- Minimum population growth
- Maximum population growth

In [9]:
%%sql
SELECT MIN(population), MAX(population),
       MIN(population_growth), MAX(population_growth)
FROM facts
WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In a different code cell, calculate the average value for the following columns:

- population
- area

In [10]:
%%sql
SELECT CAST(AVG(population) AS INTEGER), CAST(AVG(area) AS INTEGER)
FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928, 555093)]

What country has the most people? What country has the highest growth rate?

In [11]:
%%sql 
SELECT name
FROM facts
WHERE name <> 'World'
ORDER BY population DESC
LIMIT 1;

 * sqlite:///factbook.db
Done.

[('China',)]

In [12]:
%%sql 
SELECT name
FROM facts
ORDER BY population_growth DESC
LIMIT 1;

 * sqlite:///factbook.db
Done.

[('South Sudan',)]

Which countries have the highest ratios of water to land? Which countries have more water than land?

In [13]:
%%sql 
SELECT name, CAST(area_water AS FLOAT) / CAST(area_land AS FLOAT) 
       AS ratio_water_to_land
FROM facts
ORDER BY ratio_water_to_land DESC
LIMIT 5

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623)]

In [14]:
%%sql 
SELECT name, area_water, area_land 
FROM facts
WHERE area_water > area_land;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 54340, 60), ('Virgin Islands', 1564, 346)]

Which countries will add the most people to their population next year?

In [15]:
%%sql
SELECT name, CAST((population * (population_growth)/100) AS INTEGER) AS people_added_next_year
FROM facts
WHERE name <> 'World'
ORDER BY people_added_next_year DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('India', 15270686),
 ('China', 6153684),
 ('Nigeria', 4448270),
 ('Pakistan', 2906653),
 ('Ethiopia', 2874562)]

Which countries have a higher death rate than birth rate?

In [16]:
%%sql
SELECT name, death_rate, birth_rate
FROM facts
WHERE death_rate > birth_rate;

 * sqlite:///factbook.db
Done.

[('Austria', 9.42, 9.41),
 ('Belarus', 13.36, 10.7),
 ('Bosnia and Herzegovina', 9.75, 8.87),
 ('Bulgaria', 14.44, 8.92),
 ('Croatia', 12.18, 9.45),
 ('Czech Republic', 10.34, 9.63),
 ('Estonia', 12.4, 10.51),
 ('Germany', 11.42, 8.47),
 ('Greece', 11.09, 8.66),
 ('Hungary', 12.73, 9.16),
 ('Italy', 10.19, 8.74),
 ('Japan', 9.51, 7.93),
 ('Latvia', 14.31, 10.0),
 ('Lithuania', 14.27, 10.1),
 ('Moldova', 12.59, 12.0),
 ('Monaco', 9.24, 6.65),
 ('Poland', 10.19, 9.74),
 ('Portugal', 11.02, 9.27),
 ('Romania', 11.9, 9.14),
 ('Russia', 13.69, 11.6),
 ('Serbia', 13.66, 9.08),
 ('Slovenia', 11.37, 8.42),
 ('Ukraine', 14.46, 10.72),
 ('Saint Pierre and Miquelon', 9.72, 7.42)]

What countries have the highest population/area ratio and how does it compare to list we found in the previous screen?

In [17]:
%%sql 
SELECT name, population, area, population / area AS population_to_area_ratio 
FROM facts
ORDER BY population_to_area_ratio DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('Macau', 592731, 28, 21168),
 ('Monaco', 30535, 2, 15267),
 ('Singapore', 5674472, 697, 8141),
 ('Hong Kong', 7141106, 1108, 6445),
 ('Gaza Strip', 1869055, 360, 5191)]